
// ошибка: несовпадение типов параметра посланного сообщения и принятого 
// на вход подаем 
//      метку метода, который хотим протестировать (можно метку сущности)
//      2 параметра? (или метки типов? или метки размеров типов? или метку по классификации
//      id, name заранее созданных сущностей
//
// вопросы
//      какие могут быть указатели? на обычный тип переменной, на структуру, на функцию
//      если принять во внимание, что вся суть в размерах (то есть бывает всего 4 типа указателей на самом деле), то либо нужны все сочетания, либо просто больше/меньше/равно
//                  1 2 3 4 => 11, 22, 33, 44, 12, 23, 34, 13, 24, 14 - имеет ли значение порядок?
//      вопрос в том, что потом делают с этими сообщениями.
//      что если по размеру указатели совпали, но мы ожидали указатель на функцию, а получили на переменную

// ошибка: несовпадение размера сообщения (параметра) и реального размера сообщения
//      действия с сообщением?
//          - нужны ли чтобы проверить соответствие заявленных размеров реальным
//          - 
//  на вход подаем
//      метку метода, который хотим протестировать (можно метку сущности)
//      




// от чего зависит какой размер указателя?
