
// ошибка: несовпадение типов параметра посланного сообщения и принятого 
// на вход подаем 
//      метку метода, который хотим протестировать (можно метку сущности)
//      2 параметра? (или метки типов? или метки размеров типов? или метку по классификации
//      id, name заранее созданных сущностей
//
// вопросы
//      какие могут быть указатели? на обычный тип переменной (разных размеров), на структуру, на функцию
//      указатели все одного размера (4 байта?) но указывают на типы разных размеров
//      вопрос в том, что потом делают с этими сообщениями.
//      что если мы ожидали указатель на функцию, а получили на переменную

// ошибка: несовпадение размера сообщения (параметра) и реального размера сообщения
//      действия с сообщением?
//          - нужны ли чтобы проверить соответствие заявленных размеров реальным
//          - 
//  на вход подаем
//      метку метода, который хотим протестировать (можно метку сущности)
